In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
from arsenal import colors
from bench.spider.interface import SpiderInterface
from IPython.display import HTML
from genparse import EOS

import nest_asyncio
nest_asyncio.apply()

In [3]:
spider = SpiderInterface()

In [4]:
#for x in spider.dev_data[:2]:
#    print()
#    print(x.text)
#    print(x.gold_sql)
#    print(x.db_name)

In [5]:
x = spider.dev_data[0]
assert x.evaluate(x.gold_sql)
x

In [6]:
x = spider.dev_data[1]
assert x.evaluate('SELECT count(*) FROM singer')
x

In [7]:
x.run_query('SELECT count(*) FROM singer')

   count(*)
0         6

In [8]:
from pathlib import Path

import bench.spider.evaluation as E
from bench.spider.evaluation import (
    #build_foreign_key_map_from_json,
    build_valid_col_units,
    rebuild_sql_val,
    rebuild_sql_col,
    eval_exec_match,
)

def evaluate(self, gold: str, pred: str, db_name: str):
    """Returns: bool, Optional[str]

    On success (i.e., predicted execution result is the same as gold), returns `(True, None)`
    On failure, returns `(False, reason)` where reason is one of the two cases:
    * `invalid` if `pred` sql is not a well-formed sql statement that can be parsed by sqlite
    * `mismatch` if `pred` is a well-formed sql but the execution result is different from that of the `gold`.
    """
    db = self.db_path / db_name / (db_name + '.sqlite')
    schema = E.Schema(E.get_schema(db))
    g_sql = E.get_sql(schema, gold)

    try:
        p_sql = E.get_sql(schema, pred)
    except Exception as e:
        # sql is ill-formed (can't be parsed by sqlite engine)
        print(colors.red % e.__class__.__name__, e, )

        import traceback
        traceback.print_exc()
        
        return False, 'invalid'

    kmap = self.kmaps[db_name]
    g_valid_col_units = build_valid_col_units(g_sql['from']['table_units'], schema)
    g_sql = rebuild_sql_val(g_sql)
    g_sql = rebuild_sql_col(g_valid_col_units, g_sql, kmap)
    p_valid_col_units = build_valid_col_units(p_sql['from']['table_units'], schema)
    p_sql = rebuild_sql_val(p_sql)
    p_sql = rebuild_sql_col(p_valid_col_units, p_sql, kmap)

    exec_match = eval_exec_match(db, pred, gold, p_sql, g_sql)
    reason = None if exec_match else 'mismatch'

    return exec_match, reason

#spider.evaluator = evaluate

In [9]:
#x.interface.evaluator = evaluate

In [10]:
x.interface.evaluator.evaluate = evaluate

In [11]:
junk_sql = 'select count(*) from sangerz'

In [12]:
x.interface.evaluator.evaluate(x.interface.evaluator, gold = x.gold_sql, pred = junk_sql, db_name = x.db_name)

KeyError 'sangerz'

Traceback (most recent call last):
  File "/home/timv/tmp/ipykernel_257739/1033643670.py", line 25, in evaluate
    p_sql = E.get_sql(schema, pred)
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 618, in get_sql
    _, sql = parse_sql(toks, 0, tables_with_alias, schema)
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 562, in parse_sql
    from_end_idx, table_units, conds, default_tables = parse_from(
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 439, in parse_from
    idx, table_unit, table_name = parse_table_unit(
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 289, in parse_table_unit
    key = tables_with_alias[toks[idx]]
KeyError: 'sangerz'

(False, 'invalid')

In [13]:
#x.db_schema.columns

In [14]:
grammar_text = open('/home/timv/projects/genparse/benchmark/grammars/sql_case_insensitive.lark').read()

In [15]:
from genparse.util import InferenceSetupVLLM, InferenceSetup

In [16]:
#infer = InferenceSetup('codellama', grammar_text, proposal_name='character', guide_opts={'ignore': '\s*'})
infer = InferenceSetupVLLM('codellama', grammar_text, proposal_name='character', guide_opts={'ignore': r'\s*'}, batch_size=50)

INFO 06-30 02:30:19 config.py:1214] Upcasting torch.bfloat16 to torch.float32.
INFO 06-30 02:30:19 llm_engine.py:161] Initializing an LLM engine (v0.5.0.post1) with config: model='codellama/CodeLlama-7b-Instruct-hf', speculative_config=None, tokenizer='codellama/CodeLlama-7b-Instruct-hf', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, rope_scaling=None, rope_theta=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.float32, max_seq_len=4096, download_dir=None, load_format=LoadFormat.AUTO, tensor_parallel_size=1, disable_custom_all_reduce=False, quantization=None, enforce_eager=False, kv_cache_dtype=auto, quantization_param_path=None, device_config=cuda, decoding_config=DecodingConfig(guided_decoding_backend='outlines'), seed=0, served_model_name=codellama/CodeLlama-7b-Instruct-hf)
INFO 06-30 02:30:20 selector.py:136] Cannot use FlashAttention-2 backend for dtype other than torch.float16 or torch.bfloat16.
INFO 06-30 02:30:20 selector.py:51] Using XFormers backend.
INFO 06-30 02:30:21 selector.py:136] Cannot use FlashAttention-2 backend for dtype other than torch.float16 or torch.bfloat16.
INFO 06-30 02:30:21 selector.py:51] Using XFormers backend.
INFO 06-30 02:30:21 weight_utils.py:218] Using model weights format ['*.safetensors']
INFO 06-30 02:30:29 model_runner.py:160] Loading model weights took 25.1143 GB
INFO 06-30 02:30:31 gpu_executor.py:83] # GPU blocks: 605, # CPU blocks: 256
INFO 06-30 02:30:33 model_runner.py:889] Capturing the model for CUDA graphs. This may lead to unexpected consequences if the model is not static. To run the model in eager mode, set 'enforce_eager=True' or use '--enforce-eager' in the CLI.
INFO 06-30 02:30:33 model_runner.py:893] CUDA graphs can take additional 1~3 GiB memory per GPU. If you are running out of memory, consider decreasing `gpu_memory_utilization` or enforcing eager mode. You can also reduce the `max_num_seqs` as needed to decrease memory usage.
INFO 06-30 02:30:49 model_runner.py:965] Graph capturing finished in 16 secs.

In [17]:
x = spider.dev_data[2]
x

In [20]:
p = infer(x.describe(), n_particles=50, method='smc-standard', max_tokens=100)

In [41]:
#infer.proposal.timer.compare()
#infer.proposal.timer.plot_feature('t')

In [26]:
def show_posterior_tables(x, p):
    display(HTML(f'<h3>{x.text}</h3>')) 
    for y, py in sorted(p.posterior.items(), key=lambda ab: -ab[1]):
        y = y[:-1]  # remove EOS
        print(f'{colors.mark(x.evaluate(y))} {py:-.6f} {y}')
        try:
            display(x.run_query(y))
        except Exception as e:
            print()
            print(colors.dark.red % 'ðŸ’€ ERROR', e)
            print()

In [27]:
show_posterior_tables(x, p)

âœ” 0.228059 SELECT DISTINCT Name, Country, Age FROM singer ORDER BY Age DESC

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.142537 SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert, stadium where singer.Age = singer_in_concert.Age ORDER BY singer.Age DESC

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert, stadium where singer.Age = singer_in_concert.Age ORDER BY singer.Age DESC ': ambiguous column name: Name

âœ” 0.114030 SELECT DISTINCT NAME, COUNTRY, AGE FROM SINGER ORDER BY AGE DESC

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.114030 SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a, singer_in_concert b WHERE b.Singer_ID=a.S

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a, singer_in_concert b WHERE b.Singer_ID=a.S': no such column: b.Country

âœ˜ 0.057015 Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID order by singer_in_concert.Name DESC

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID order by singer_in_concert.Name DESC': ambiguous column name: name

âœ˜ 0.057015 SELECT DISTINCT singer.name, singer.country, singer.age FROM singer join singer_in_concert on singer.singer_id=singer_in_concert.singer_id

           Name        Country  Age
0     Timbaland  United States   32
1  Justin Brown         France   29
2  John Nizinik         France   43
3   Tribal King         France   25
4    Rose White         France   41

âœ˜ 0.055353 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.StarterPID = (SELECT MAX(judgementLatest_tmp.StarterPID) FROM judgementLatest_tmp WHERE judgementLatest_tmp.Starter_ID = judgement

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.StarterPID = (SELECT MAX(judgementLatest_tmp.StarterPID) FROM judgementLatest_tmp WHERE judgementLatest_tmp.Starter_ID = judgement': incomplete input

âœ˜ 0.028507 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID ORDER BY x.AGE

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID ORDER BY x.AGE  ': no such column: everything

âœ˜ 0.028507 SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert WHERE concert.Singer_ID = singer.Singer_ID AND concert.Concert_ID = Singer_in_concert AND Age IS NOT NULL ORDER BY Age DESC

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert WHERE concert.Singer_ID = singer.Singer_ID AND concert.Concert_ID = Singer_in_concert AND Age IS NOT NULL ORDER BY Age DESC': no such column: concert.Singer_ID

âœ˜ 0.025759 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS a ON judgementLatest_tmp.Starter_ID = a

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS a ON judgementLatest_tmp.Starter_ID = a': no such table: judgementLatest_tmp

âœ˜ 0.024500 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Stadium_ID ORDER BY b.Ag

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Stadium_ID ORDER BY b.Ag': no such column: b.Country

âœ˜ 0.022829 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS JudgementLatestRanking ON judgementLatest_tmp

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS JudgementLatestRanking ON judgementLatest_tmp': no such table: judgementLatest_tmp

âœ˜ 0.021057 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID AND d.Theme =

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID AND d.Theme = ': incomplete input

âœ˜ 0.015780 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Singer_ID ORDER BY f.age DES

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Singer_ID ORDER BY f.age DES': near "DES": syntax error

âœ˜ 0.014942 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID ORDER BY f.Age DES

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID ORDER BY f.Age DES': near "DES": syntax error

âœ˜ 0.013461 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN msp_judgement ON judgementLatest_tmp.StarterID = msp_judgement.FK_StarterID GROUP BY msp_judgement.FK_StarterID HAVING COUNT(msp_judgement.FK_StarterID) > 0 ORDER BY COUNT(msp_judgement.F

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN msp_judgement ON judgementLatest_tmp.StarterID = msp_judgement.FK_StarterID GROUP BY msp_judgement.FK_StarterID HAVING COUNT(msp_judgement.FK_StarterID) > 0 ORDER BY COUNT(msp_judgement.F': incomplete input

âœ˜ 0.009059 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY judgementLatest_tmp.HitValue DESC) AS Ranking FROM judgementLatest_tmp ) AS ranked ON(judgementLatest_tmp.Starter_ID = ranked.Starter_ID AND ranke

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY judgementLatest_tmp.HitValue DESC) AS Ranking FROM judgementLatest_tmp ) AS ranked ON(judgementLatest_tmp.Starter_ID = ranked.Starter_ID AND ranke': incomplete input

âœ˜ 0.008699 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y INNER JOIN concert  where x.Singer_ID  = y.singer_ID  and  x.Country   = y.Country   and   y.singer_id =  x.Singer_ID and concert_Name = y.Stadium_id and   x.Is_male = y.Is_male  and   is_shown =  random an

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y INNER JOIN concert  where x.Singer_ID  = y.singer_ID  and  x.Country   = y.Country   and   y.singer_id =  x.Singer_ID and concert_Name = y.Stadium_id and   x.Is_male = y.Is_male  and   is_shown =  random an': near "an": syntax error

âœ˜ 0.006551 SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a JOIN singin_in_concert b ON a.Singer_Id=b.Singer_Id  GROUP BY a.Name, b.Country, a.Age ORDER BY a.Age DESC

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a JOIN singin_in_concert b ON a.Singer_Id=b.Singer_Id  GROUP BY a.Name, b.Country, a.Age ORDER BY a.Age DESC': no such table: singin_in_concert

âœ˜ 0.006323 SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.concert_i

ðŸ’€ ERROR Execution failed on sql 'SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.concert_i': no such table: concertalbums

âœ˜ 0.002072 SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_ID = concerts_id JOIN singers_in_concerts ON concerts.concert_ID = singers_in_concerts.concert_ID JOIN singers ON singers.singer_id = singers_in_concerts.singer_id order by age desc

ðŸ’€ ERROR Execution failed on sql 'SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_ID = concerts_id JOIN singers_in_concerts ON concerts.concert_ID = singers_in_concerts.concert_ID JOIN singers ON singers.singer_id = singers_in_concerts.singer_id order by age desc': no such table: concertalbums

âœ˜ 0.001977 SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.age LIMIT

ðŸ’€ ERROR Execution failed on sql 'SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.age LIMIT ': incomplete input

âœ˜ 0.001679 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = '1' ORDER BY f.Age DESC

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = '1' ORDER BY f.Age DESC': no such column: b.Country

âœ˜ 0.000219 Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age asc limit 10

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age asc limit 10': ambiguous column name: name

âœ˜ 0.000025 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.Token_ID = judgement.Token_ID LEFT JOIN uib40 ON judgement.Starter_ID = uib40.Starter_ID WHERE does not in (Ameloglossus_

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.Token_ID = judgement.Token_ID LEFT JOIN uib40 ON judgement.Starter_ID = uib40.Starter_ID WHERE does not in (Ameloglossus_': incomplete input

âœ˜ 0.000015 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY  AVG(z.year )   DESC  LIMIT 5  OF

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY  AVG(z.year )   DESC  LIMIT 5  OF': near "OF": syntax error

âœ˜ 0.000001 Select name, country, age from singer, singer_in_concert, concert, stadium where singer_in_concert.Singer_ID = singer.Singer_ID and concert.concert_ID = singer_in_concert.concert_ID and singer.Age > 18 and concert.concert_ID in (select concert_ID from singer_in_concert) order by age desc limit 100000

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer_in_concert, concert, stadium where singer_in_concert.Singer_ID = singer.Singer_ID and concert.concert_ID = singer_in_concert.concert_ID and singer.Age > 18 and concert.concert_ID in (select concert_ID from singer_in_concert) order by age desc limit 100000': ambiguous column name: name

âœ˜ 0.000000 Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age desc limit 50 offset 100000000

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age desc limit 50 offset 100000000': ambiguous column name: name

âœ˜ 0.000000 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY AGE desc  EXCEPT SELECT lagtage FROM singer WHERE score

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY AGE desc  EXCEPT SELECT lagtage FROM singer WHERE score ': ORDER BY clause should come after EXCEPT not before

### Approximate Minimum Bayes Risk Decoding

In [28]:
x.gold_sql

'SELECT name ,  country ,  age FROM singer ORDER BY age DESC'

In [29]:
print(x.describe())

You are a coding assistant helping an analyst answer questions over business data in SQL.
More specifically, the analyst provides you a database schema
(tables in the database along with their column names and types)
and asks a question about the data that can be solved by issuing a SQL query to the database.
In response, you write the SQL statement that answers the question.
You do not provide any commentary or explanation of what the code does,
just the SQL statement ending in a semicolon.

Here is a database schema:

stadium
* Stadium_ID (number): stadium id
* Location (text): location
* Name (text): name
* Capacity (number): capacity
* Highest (number): highest
* Lowest (number): lowest
* Average (number): average

singer
* Singer_ID (number): singer id
* Name (text): name
* Country (text): country
* Song_Name (text): song name
* Song_release_year (text): song release year
* Age (number): age
* Is_male (others): is male

concert
* concert_ID (number): concert id
* concert_Name (text): concert name
* Theme (text): theme
* Stadium_ID (text): stadium id
* Year (text): year

singer_in_concert
* concert_ID (number): concert id
* Singer_ID (text): singer id

Please write me a SQL statement that answers the following question: Show name, country, age for all singers ordered by age from the oldest to the youngest.

Remember, DO NOT provide any commentary or explanation of what the code does, just the SQL statement ending in a semicolon.

In [30]:
def EVAL(x, y1, y2):
    if y1.endswith(EOS): y1 = y1[:-1]  
    if y2.endswith(EOS): y2 = y2[:-1]
    try:
        return x.interface.evaluate(y1, y2, x.db_name)[0]
    except Exception:
#        print(e)
        return False

In [38]:
def risk(x, candidate, particles):
    return sum(p * EVAL(x, candidate, y)        
               for y, p in particles.posterior.items())

In [39]:
def show_mbr_tables(x, particles):
    display(HTML(f'<h3>{x.text}</h3>')) 
    risks = {candidate: risk(x, candidate, particles) for candidate in particles.posterior}
    for candidate in sorted(risks, key=risks.__getitem__, reverse=True):
        print(colors.mark(x.evaluate(candidate[:-1] if candidate.endswith(EOS) else candidate)), 
              f'{risks[candidate]:f}', (colors.dark.magenta if risks[candidate] == 0 else colors.light.magenta) % candidate)
        try:
            display(x.run_query(candidate[:-1] if candidate.endswith(EOS) else candidate))
        except Exception as e:
            print()
            print(colors.dark.red % 'ðŸ’€ ERROR', e)
            print()

In [40]:
show_mbr_tables(x, p)

âœ” 0.342089 SELECT DISTINCT Name, Country, Age FROM singer ORDER BY Age DESCâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.342089 SELECT DISTINCT NAME, COUNTRY, AGE FROM SINGER ORDER BY AGE DESCâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.000000 Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID order by singer_in_concert.Name DESCâ–ª

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID order by singer_in_concert.Name DESC': ambiguous column name: name

âœ˜ 0.000000 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = '1' ORDER BY f.Age DESCâ–ª

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = '1' ORDER BY f.Age DESC': no such column: b.Country

âœ˜ 0.000000 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Singer_ID ORDER BY f.age DESC

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Singer_ID ORDER BY f.age DESC': no such column: b.Country

âœ˜ 0.000000 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID ORDER BY f.Age DESC

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID ORDER BY f.Age DESC': no such column: b.Country

âœ˜ 0.000000 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.StarterPID = (SELECT MAX(judgementLatest_tmp.StarterPID) FROM judgementLatest_tmp WHERE judgementLatest_tmp.Starter_ID = judgement.

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.StarterPID = (SELECT MAX(judgementLatest_tmp.StarterPID) FROM judgementLatest_tmp WHERE judgementLatest_tmp.Starter_ID = judgement.': incomplete input

âœ˜ 0.000000 SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a, singer_in_concert b WHERE b.Singer_ID=a.Sâ–ª

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a, singer_in_concert b WHERE b.Singer_ID=a.S': no such column: b.Country

âœ˜ 0.000000 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY judgementLatest_tmp.HitValue DESC) AS Ranking FROM judgementLatest_tmp ) AS ranked ON(judgementLatest_tmp.Starter_ID = ranked.Starter_ID AND ranked

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY judgementLatest_tmp.HitValue DESC) AS Ranking FROM judgementLatest_tmp ) AS ranked ON(judgementLatest_tmp.Starter_ID = ranked.Starter_ID AND ranked': incomplete input

âœ˜ 0.000000 SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_ID = concerts_id JOIN singers_in_concerts ON concerts.concert_ID = singers_in_concerts.concert_ID JOIN singers ON singers.singer_id = singers_in_concerts.singer_id order by age descâ–ª

ðŸ’€ ERROR Execution failed on sql 'SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_ID = concerts_id JOIN singers_in_concerts ON concerts.concert_ID = singers_in_concerts.concert_ID JOIN singers ON singers.singer_id = singers_in_concerts.singer_id order by age desc': no such table: concertalbums

âœ˜ 0.000000 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID ORDER BY x.AGE  â–ª

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID ORDER BY x.AGE  ': no such column: everything

âœ˜ 0.000000 SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert WHERE concert.Singer_ID = singer.Singer_ID AND concert.Concert_ID = Singer_in_concert AND Age IS NOT NULL ORDER BY Age DESCâ–ª

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert WHERE concert.Singer_ID = singer.Singer_ID AND concert.Concert_ID = Singer_in_concert AND Age IS NOT NULL ORDER BY Age DESC': no such column: concert.Singer_ID

âœ˜ 0.000000 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS JudgementLatestRanking ON judgementLatest_tmp.

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS JudgementLatestRanking ON judgementLatest_tmp.': incomplete input

âœ˜ 0.000000 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY AGE desc  EXCEPT SELECT lagtage FROM singer WHERE score =

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY AGE desc  EXCEPT SELECT lagtage FROM singer WHERE score =': incomplete input

âœ˜ 0.000000 Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age desc limit 50 offset 1000000000

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age desc limit 50 offset 1000000000': ambiguous column name: name

âœ˜ 0.000000 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y INNER JOIN concert  where x.Singer_ID  = y.singer_ID  and  x.Country   = y.Country   and   y.singer_id =  x.Singer_ID and concert_Name = y.Stadium_id and   x.Is_male = y.Is_male  and   is_shown =  random and

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y INNER JOIN concert  where x.Singer_ID  = y.singer_ID  and  x.Country   = y.Country   and   y.singer_id =  x.Singer_ID and concert_Name = y.Stadium_id and   x.Is_male = y.Is_male  and   is_shown =  random and': incomplete input

âœ˜ 0.000000 SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert, stadium where singer.Age = singer_in_concert.Age ORDER BY singer.Age DESC â–ª

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Name, Country, Age FROM singer, concert, singer_in_concert, stadium where singer.Age = singer_in_concert.Age ORDER BY singer.Age DESC ': ambiguous column name: Name

âœ˜ 0.000000 SELECT DISTINCT singer.name, singer.country, singer.age FROM singer join singer_in_concert on singer.singer_id=singer_in_concert.singer_id â–ª

           Name        Country  Age
0     Timbaland  United States   32
1  Justin Brown         France   29
2  John Nizinik         France   43
3   Tribal King         France   25
4    Rose White         France   41

âœ˜ 0.000000 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN msp_judgement ON judgementLatest_tmp.StarterID = msp_judgement.FK_StarterID GROUP BY msp_judgement.FK_StarterID HAVING COUNT(msp_judgement.FK_StarterID) > 0 ORDER BY COUNT(msp_judgement.FK

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN msp_judgement ON judgementLatest_tmp.StarterID = msp_judgement.FK_StarterID GROUP BY msp_judgement.FK_StarterID HAVING COUNT(msp_judgement.FK_StarterID) > 0 ORDER BY COUNT(msp_judgement.FK': incomplete input

âœ˜ 0.000000 SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a JOIN singin_in_concert b ON a.Singer_Id=b.Singer_Id  GROUP BY a.Name, b.Country, a.Age ORDER BY a.Age DESCâ–ª

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, a.Age, (SELECT COUNT(*) FROM singer_in_concert WHERE a.Singer_Id=Singer_ID) AS 'AppearanceIn' FROM singer a JOIN singin_in_concert b ON a.Singer_Id=b.Singer_Id  GROUP BY a.Name, b.Country, a.Age ORDER BY a.Age DESC': no such table: singin_in_concert

âœ˜ 0.000000 Select name, country, age from singer, singer_in_concert, concert, stadium where singer_in_concert.Singer_ID = singer.Singer_ID and concert.concert_ID = singer_in_concert.concert_ID and singer.Age > 18 and concert.concert_ID in (select concert_ID from singer_in_concert) order by age desc limit 1000000

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer_in_concert, concert, stadium where singer_in_concert.Singer_ID = singer.Singer_ID and concert.concert_ID = singer_in_concert.concert_ID and singer.Age > 18 and concert.concert_ID in (select concert_ID from singer_in_concert) order by age desc limit 1000000': ambiguous column name: name

âœ˜ 0.000000 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID AND d.Theme = e

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_ID AND c.concert_ID = d.concert_ID AND d.Stadium_ID = e.Stadium_ID AND a.Singer_ID = f.Singer_ID AND d.Theme = e': no such column: b.Country

âœ˜ 0.000000 Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age asc limit 10â–ª

ðŸ’€ ERROR Execution failed on sql 'Select name, country, age from singer, singer inner join concert on singer.Singer_ID = concert.Singer_ID, singer inner join singer_in_concert on singer.Singer_ID = singer_in_concert.Singer_ID, concert inner join concert on concert.concert_ID = concert_in_concert.concert_ID order by age asc limit 10': ambiguous column name: name

âœ˜ 0.000000 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.Token_ID = judgement.Token_ID LEFT JOIN uib40 ON judgement.Starter_ID = uib40.Starter_ID WHERE does not in (Ameloglossus_g

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN judgement ON judgementLatest_tmp.Starter_ID = judgement.Starter_ID AND judgementLatest_tmp.Token_ID = judgement.Token_ID LEFT JOIN uib40 ON judgement.Starter_ID = uib40.Starter_ID WHERE does not in (Ameloglossus_g': incomplete input

âœ˜ 0.000000 SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.concert_id

ðŸ’€ ERROR Execution failed on sql 'SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.concert_id': no such table: concertalbums

âœ˜ 0.000000 SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS a ON judgementLatest_tmp.Starter_ID = a.

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT Starter_ID FROM judgementLatest_tmp INNER JOIN(SELECT  judgementLatest_tmp.Starter_ID,RANK() OVER(PARTITION BY Starter_ID ORDER BY LATEST_DAY DESC,LATEST_TIME DESC,LATEST_VERSION DESC) AS Rank FROM judgementLatest_tmp ) AS a ON judgementLatest_tmp.Starter_ID = a.': incomplete input

âœ˜ 0.000000 Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY  AVG(z.year )   DESC  LIMIT 5  OFF

ðŸ’€ ERROR Execution failed on sql 'Select everything from singer INNER JOIN singer x INNER JOIN singer_in_concert y on x.Singer_ID =  y.Singer_ID INNER JOIN concert  z on z.concert_ID = y.concert_ID where z.Themes = AHHH GROUP BY  x.name HAVING  AVG(z.Year ) > 30 ORDER BY  AVG(z.year )   DESC  LIMIT 5  OFF': near "OFF": syntax error

âœ˜ 0.000000 SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Stadium_ID ORDER BY b.Age

ðŸ’€ ERROR Execution failed on sql 'SELECT DISTINCT a.Name, b.Country, b.Age FROM singer a, singer_in_concert c, concert d, stadium e, singer f WHERE a.Singer_ID = c.singer_id AND c.concert_id = d.concert_id AND d.Stadium_ID = e.stadium_id AND e.Stadium_ID = f.Stadium_ID ORDER BY b.Age': no such column: b.Country

âœ˜ 0.000000 SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.age LIMIT 5

ðŸ’€ ERROR Execution failed on sql 'SELECT * FROM singer consultatoevents LEFT JOIN concertalbums ON concerts.concert_id = events.concert_id LEFT JOIN artists ON events.artist_id = artists.artist_id WHERE events.concert_id >= args.concert_id GROUP BY events.artist, events.artist_id, events.ranked_name ORDER BY events.ranked_name DESC, events.artist_id, events.age LIMIT 5': no such table: concertalbums